[
  {
    "slug": "lark-platform-migration",
    "title": {
      "en": "Multi-platform Consolidation → Lark Migration",
      "th": "การรวมแพลตฟอร์มหลายระบบสู่ Lark"
    },
    "tagline": {
      "en": "Consolidating multiple platforms to Lark for cost reduction and efficiency",
      "th": "การรวมแพลตฟอร์มหลายระบบสู่ Lark เพื่อลดต้นทุนและเพิ่มประสิทธิภาพ"
    },
    "year": "2024",
    "role": {
      "en": "IT Manager (Report to CTO)",
      "th": "IT Manager (รายงานต่อ CTO)"
    },
    "stack": [
      "Lark",
      "Google Workspace",
      "Microsoft 365",
      "Jira",
      "LINE",
      "Discord",
      "Project Management"
    ],
    "coverImage": "/images/projects/lark-migration-cover.jpg",
    "highlights": [
      {
        "en": "Reduced annual costs by 40% and expected to reach 60% after custom features implementation",
        "th": "ลดต้นทุนรายปีได้ 40% และคาดว่าจะลดได้ 60% หลัง custom feature"
      },
      {
        "en": "Migrated ~450 users from multiple platforms",
        "th": "ย้ายผู้ใช้งาน ~450 คน จากหลายแพลตฟอร์ม"
      },
      {
        "en": "End-to-end migration: workflow mapping, data migration, training",
        "th": "Migration end-to-end: workflow mapping, data migration, training"
      }
    ],
    "problem": {
      "en": "The organization used multiple platforms simultaneously (LINE, Jira, Google Workspace, Microsoft 365, Discord), leading to management complexity, scattered data, unsystematic communication, and high costs from multiple license subscriptions.",
      "th": "องค์กรใช้หลายแพลตฟอร์มพร้อมกัน (LINE, Jira, Google Workspace, Microsoft 365, Discord) ทำให้เกิดความซับซ้อนในการจัดการ ข้อมูลกระจัดกระจาย การสื่อสารไม่เป็นระบบ และค่าใช้จ่ายสูงจากการต้องซื้อ license หลายแพลตฟอร์ม"
    },
    "approach": {
      "en": "Planned and executed a full migration to Lark as a centralized platform. This involved mapping existing workflows, creating SOPs for usage, training the team, and providing close support to ensure full potential usage. Also planned custom features to cover all organizational needs.",
      "th": "วางแผนและดำเนินการย้ายระบบทั้งหมดไปใช้ Lark เป็นศูนย์กลาง โดยทำการ mapping workflow ที่มีอยู่ สร้าง SOP สำหรับการใช้งาน ฝึกอบรมทีมงาน และให้การสนับสนุนอย่างใกล้ชิดเพื่อให้เกิดการใช้งานอย่างเต็มศักยภาพ พร้อมวางแผน custom features เพิ่มเติมเพื่อให้ครอบคลุมทุกความต้องการขององค์กร"
    },
    "results": {
      "en": "Successfully migrated 450 users to the new Lark system, reducing annual costs by 40% (expected 60% after custom features). Usage became more systematic, significantly improving communication and collaboration reliability.",
      "th": "โครงการประสบความสำเร็จในการย้ายผู้ใช้งาน 450 คนเข้าสู่ระบบ Lark ใหม่ โดยลดค่าใช้จ่ายรายปีได้ 40% และคาดว่าจะสามารถลดได้ถึง 60% หลังจากที่ custom features เสร็จสมบูรณ์ การใช้งานเป็นระบบมากขึ้น ช่วยให้การสื่อสารและการทำงานร่วมกันมีประสิทธิภาพดีขึ้นอย่างเห็นได้ชัด"
    },
    "galleryImages": [
      "/images/projects/lark-migration-1.jpg",
      "/images/projects/lark-migration-2.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  },
  {
    "slug": "itil-ai-chat-uat",
    "title": {
      "en": "ITIL v4 AI Chat UAT",
      "th": "ITIL v4 AI Chat UAT"
    },
    "tagline": {
      "en": "Intelligent chatbot for ITIL v4 Q&A and automated reporting",
      "th": "ระบบแชทบอทอัจฉริยะสำหรับถาม-ตอบข้อมูล ITIL v4 และสร้างรายงานอัตโนมัติ"
    },
    "year": "2024",
    "role": {
      "en": "Event Manager (Outsource) - POC",
      "th": "Event Manager (Outsource) - POC"
    },
    "stack": [
      "n8n",
      "Local LLMs Model",
      "OneDrive/SharePoint",
      "CSV",
      "Python",
      "Webhook",
      "Data Visualization",
      "Report Generation"
    ],
    "coverImage": "/images/projects/itil-ai-chat-cover.jpg",
    "highlights": [
      {
        "en": "Reduced search time from multiple Excel files to instant Q&A",
        "th": "ลดเวลาค้นหาข้อมูลจากหลายไฟล์ Excel เหลือเพียงแค่ถาม-ตอบทันที"
      },
      {
        "en": "Connected 3 years of historical data from CSV on OneDrive via n8n workflow",
        "th": "เชื่อมต่อข้อมูลย้อนหลัง 3 ปีจาก CSV บน OneDrive ผ่าน n8n workflow"
      },
      {
        "en": "Used Local LLMs Model to read data from Incident, Problem, Change, Event, Service Request, SLA, Availability",
        "th": "ใช้ Local LLMs Model อ่านข้อมูลจาก Incident, Problem, Change, Event, Service Request, SLA, Availability"
      },
      {
        "en": "Automated weekly/monthly/yearly report and graph generation for VP and SVP",
        "th": "สร้างรายงานและกราฟอัตโนมัติสำหรับ VP และ SVP ประจำสัปดาห์/เดือน/ปี"
      },
      {
        "en": "Designed with security in mind: DLP, Sensitivity Labels, Audit Log",
        "th": "ออกแบบตามหลัก Security: DLP, Sensitivity Labels, Audit Log"
      }
    ],
    "problem": {
      "en": "The team spent excessive time searching for ITIL v4 data (Incident, Problem, Change, Event, Service Request, SLA, Availability) across multiple Excel files containing 3 years of history, causing delays in responses and decision-making.",
      "th": "ทีมงานต้องใช้เวลามากในการค้นหาข้อมูล ITIL v4 (Incident, Problem, Change, Event, Service Request, SLA, Availability) จากหลายไฟล์ Excel ที่เก็บข้อมูลย้อนหลัง 3 ปี ทำให้การตอบคำถามและการตัดสินใจล่าช้า และไม่สามารถเข้าถึงข้อมูลได้อย่างรวดเร็ว"
    },
    "approach": {
      "en": "Developed a web chatbot connected to n8n workflow to read CSV files stored on OneDrive/SharePoint. It uses Local LLMs to interpret data and generate reports/graphs or answer questions for VP/SVP. Security measures include DLP, Sensitivity Labels, and Audit logs.",
      "th": "พัฒนาเว็บแชทบอทที่เชื่อมต่อกับ n8n workflow เพื่ออ่านข้อมูลจากไฟล์ CSV ที่เก็บบน OneDrive/SharePoint โดยเชื่อมต่อ CSV ใน OneDrive กับ n8n และใช้ Local LLMs Model อ่านข้อมูลจากไฟล์ Incident, Problem, Change, Event, Service Request, SLA, Availability เพื่อสร้าง Report หรือ Graph และเรียงข้อความเพื่อตอบคำถาม VP และ SVP ประจำสัปดาห์ ประจำเดือน และประจำปี โดยออกแบบระบบให้มีความปลอดภัยด้วยการเสนอใช้ DLP (Data Loss Prevention) และ Sensitivity Labels เพื่อป้องกันข้อมูลสำคัญรั่วไหล และมี Audit log ทุกครั้งที่ workflow ทำงาน"
    },
    "results": {
      "en": "The system provides fast and accurate ITIL v4 answers, significantly reducing search time. It automates report generation for executive management. Future plans include connecting to other teams' files (Network, Unix, Windows, etc.) for broader technical query support.",
      "th": "ระบบสามารถตอบคำถามเกี่ยวกับ ITIL v4 ได้อย่างรวดเร็วและแม่นยำ ลดเวลาการค้นหาข้อมูลจากหลายไฟล์ Excel ลงเหลือเพียงแค่พิมพ์ถามและได้รับคำตอบทันที ระบบสามารถเชื่อมต่อ CSV ใน OneDrive กับ n8n และใช้ Local LLMs Model อ่านข้อมูลจากไฟล์ Incident, Problem, Change, Event, Service Request, SLA, Availability เพื่อสร้าง Report หรือ Graph และเรียงข้อความเพื่อตอบคำถาม VP และ SVP ประจำสัปดาห์ ประจำเดือน และประจำปี ปัจจุบันได้วางแผนเพื่อเชื่อมต่อกับไฟล์ของทีมอื่นๆ เช่น Network, Unix, Windows, Security path, Noc, Service Desk เพื่อให้การตอบคำถามเชิงเทคนิคเร็วขึ้น"
    },
    "galleryImages": [
      "/images/projects/itil-ai-chat-1.jpg",
      "/images/projects/itil-ai-chat-2.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  },
  {
    "slug": "event-consolidation-pagerduty",
    "title": {
      "en": "IT Event Consolidation (Omnibus → PagerDuty Migration)",
      "th": "IT Event Consolidation (Omnibus → PagerDuty Migration)"
    },
    "tagline": {
      "en": "Consolidating Event Management from Omnibus to PagerDuty for better efficiency",
      "th": "รวมระบบ Event Management จาก Omnibus ไป PagerDuty เพื่อประสิทธิภาพที่ดีขึ้น"
    },
    "year": "2023",
    "role": {
      "en": "Event Manager (Outsource)",
      "th": "Event Manager (Outsource)"
    },
    "stack": [
      "PagerDuty",
      "Omnibus",
      "ITIL v4",
      "Event Management",
      "Integration"
    ],
    "coverImage": "/images/projects/pagerduty-migration-cover.jpg",
    "highlights": [
      {
        "en": "Reduced P4 Noise and created effective Thresholds",
        "th": "ลด P4 Noise และสร้าง Threshold ที่มีประสิทธิภาพ"
      },
      {
        "en": "Investigated and reduced False alarms",
        "th": "ตรวจสอบและลด False alarm"
      },
      {
        "en": "Improved Event Management efficiency according to ITIL v4",
        "th": "ปรับปรุงประสิทธิภาพ Event Management ตาม ITIL v4"
      }
    ],
    "problem": {
      "en": "The existing Event Management system (Omnibus) had issues with high false alarms, excessive P4 noise, and improper thresholds, wasting team time and risking missed critical events.",
      "th": "ระบบ Event Management เดิมที่ใช้ Omnibus มีปัญหาเรื่อง false alarm จำนวนมาก P4 noise ที่สูง และ threshold ที่ไม่เหมาะสม ทำให้ทีมงานเสียเวลาในการจัดการกับ alarm ที่ไม่จำเป็น และอาจทำให้พลาดเหตุการณ์สำคัญที่แท้จริง"
    },
    "approach": {
      "en": "Planned and executed migration to PagerDuty. Analyzed monitoring data to establish proper thresholds, reduce P4 noise, and tune settings to minimize false alarms. Established workflows and processes aligned with ITIL v4.",
      "th": "วางแผนและดำเนินการย้ายระบบ Event Management จาก Omnibus ไปใช้ PagerDuty โดยทำการวิเคราะห์ข้อมูลจาก Monitoring Tools เพื่อสร้าง threshold ที่เหมาะสม ลด P4 noise และปรับแต่งการตั้งค่าต่างๆ เพื่อลด false alarm พร้อมสร้าง workflow และ process ตาม ITIL v4 เพื่อให้การจัดการ event มีประสิทธิภาพมากขึ้น"
    },
    "results": {
      "en": "Significantly reduced false alarms. Improved thresholds led to more accurate critical event detection. Event management became more efficient per ITIL v4 standards, allowing the team to focus on critical tasks.",
      "th": "ระบบใหม่สามารถลด false alarm ได้อย่างมีนัยสำคัญ และ threshold ที่ปรับปรุงแล้วทำให้การตรวจจับเหตุการณ์สำคัญทำได้แม่นยำขึ้น การจัดการ event มีประสิทธิภาพมากขึ้นตามหลัก ITIL v4 และช่วยให้ทีมงานมีเวลาไปจัดการกับงานสำคัญอื่นๆ มากขึ้น"
    },
    "galleryImages": [
      "/images/projects/pagerduty-migration-1.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  },
  {
    "slug": "bank-itsm-monitor-migration",
    "title": {
      "en": "Bank ITSM Tools Monitor Migration Data Center",
      "th": "Bank ITSM Tools Monitor Migration Data Center"
    },
    "tagline": {
      "en": "Migrating Monitoring Tools between Data Centers following ITIL v4",
      "th": "ย้าย Monitoring Tools ระหว่าง Data Center ตามหลัก ITIL v4"
    },
    "year": "2023",
    "role": {
      "en": "Event Manager (Outsource)",
      "th": "Event Manager (Outsource)"
    },
    "stack": [
      "Sitescope",
      "SolarWinds",
      "ITIL v4",
      "Event Management",
      "Change Management",
      "Data Center"
    ],
    "coverImage": "/images/projects/dc-migration-cover.jpg",
    "highlights": [
      {
        "en": "Controlled Event/Incident/Change during migration",
        "th": "ควบคุม Event/Incident/Change ระหว่างการย้ายระบบ"
      },
      {
        "en": "Created Workflow Process, RACI + Runbook",
        "th": "จัดทำ Workflow Process, RACI + Runbook"
      },
      {
        "en": "Reduced change fallout and created SOPs",
        "th": "ลด fallout จาก change และสร้าง SOP"
      }
    ],
    "problem": {
      "en": "The organization needed to migrate Monitoring Tools from Sitescope to SolarWinds on Data Center servers without service disruption, requiring systematic change control to minimize risks.",
      "th": "องค์กรต้องการย้าย Monitoring Tools จาก Sitescope ไปใช้ SolarWinds บน server Data Center โดยต้องไม่กระทบต่อการให้บริการ และต้องมีการควบคุมการเปลี่ยนแปลงอย่างเป็นระบบเพื่อลดความเสี่ยงจากการเปลี่ยนแปลงระบบ"
    },
    "approach": {
      "en": "Managed Event, Incident, and Change Management during migration. Drafted clear Workflow Processes, RACI matrices, and Runbooks. Created SOPs for recurring issues, aligning with ITIL v4 to ensure a systematic and low-risk migration.",
      "th": "รับผิดชอบในการควบคุม Event, Incident และ Change Management ระหว่างการย้ายระบบ โดยร่าง Workflow Process ที่ชัดเจน จัดทำ RACI matrix เพื่อกำหนดความรับผิดชอบ สร้าง Runbook สำหรับการแก้ไขปัญหา และจัดทำ SOP สำหรับปัญหาที่เกิดขึ้นซ้ำๆ พร้อม align กับหลักการ ITIL v4 เพื่อให้การย้ายระบบเป็นไปอย่างมีระบบและลดความเสี่ยง"
    },
    "results": {
      "en": "Migration completed with minimal fallout and controlled events. Workflows, RACI, and Runbooks improved team efficiency, and SOPs significantly reduced time on recurring issues.",
      "th": "การย้ายระบบสำเร็จลุล่วงโดยมี fallout น้อยที่สุด และสามารถควบคุมเหตุการณ์ที่เกิดขึ้นได้อย่างเป็นระบบ การมี Workflow, RACI และ Runbook ช่วยให้ทีมงานทำงานได้อย่างมีประสิทธิภาพ และ SOP ที่จัดทำไว้ช่วยลดเวลาในการแก้ไขปัญหาซ้ำๆ ลงอย่างมาก"
    },
    "galleryImages": [
      "/images/projects/dc-migration-1.jpg",
      "/images/projects/dc-migration-2.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  },
  {
    "slug": "network-monitoring-dashboard",
    "title": {
      "en": "Network Monitoring & Real-time Dashboard + LINE Alerts",
      "th": "Network Monitoring & Real-time Dashboard + LINE Alerts"
    },
    "tagline": {
      "en": "Network monitoring system and Real-time Dashboard with LINE Alerts",
      "th": "ระบบตรวจสอบเครือข่ายและ Dashboard แบบเรียลไทม์พร้อมแจ้งเตือนผ่าน LINE"
    },
    "year": "2020",
    "role": {
      "en": "Project Developer (University)",
      "th": "Project Developer (University)"
    },
    "stack": [
      "Cacti",
      "RRDTool",
      "SNMPv3",
      "Telegraf",
      "InfluxDB",
      "Prometheus",
      "Grafana",
      "LINE Notify"
    ],
    "coverImage": "/images/projects/network-monitoring-cover.jpg",
    "highlights": [
      {
        "en": "Real-time Dashboard (~5s refresh)",
        "th": "Dashboard เรียลไทม์ (~5s refresh)"
      },
      {
        "en": "Reduced MTTR by 50-60%",
        "th": "ลด MTTR เฉลี่ย 50-60%"
      },
      {
        "en": "Reduced false alerts to 0%",
        "th": "ลด false alert เหลือ 0%"
      }
    ],
    "problem": {
      "en": "University computer staff spent excessive time checking network status and often discovered issues after they occurred, causing delayed resolution and time wasted on false alerts.",
      "th": "เจ้าหน้าที่คอมพิวเตอร์ของมหาวิทยาลัยใช้เวลามากในการตรวจสอบสถานะเครือข่าย และมักพบปัญหาหลังจากที่เกิดเหตุการณ์ไปแล้ว ทำให้การแก้ไขล่าช้า และมี false alert จำนวนมากที่ทำให้เสียเวลา"
    },
    "approach": {
      "en": "Installed Cacti (RRDTool + SNMPv3) for traffic/uptime data. Built a pipeline (Telegraf → InfluxDB/Prometheus → Grafana) for a real-time dashboard (5s refresh) with LINE Notify alerts for link downs or threshold breaches.",
      "th": "ติดตั้ง Cacti (RRDTool + SNMPv3) สำหรับเก็บข้อมูล traffic และ uptime และสร้าง pipeline ระหว่าง Telegraf → InfluxDB/Prometheus → Grafana เพื่อสร้าง dashboard แบบเรียลไทม์ (refresh ทุก 5 วินาที) พร้อมระบบแจ้งเตือนผ่าน LINE Notify เมื่อ link down หรือมีการใช้งานเกิน threshold"
    },
    "results": {
      "en": "Enabled rapid and accurate network status monitoring. Reduced MTTR (Mean Time To Repair) by 50-60% and optimized thresholds to eliminate false alerts (0%). The system is used university-wide.",
      "th": "ระบบช่วยให้เจ้าหน้าที่สามารถตรวจสอบสถานะเครือข่ายได้อย่างรวดเร็วและแม่นยำ สามารถแก้ไขปัญหาได้เร็วขึ้นโดยลด MTTR (Mean Time To Repair) เฉลี่ย 50-60% และสามารถปรับแต่ง threshold ให้เหมาะสมจนลด false alert ลงเหลือ 0% ระบบใช้งานจริงทั่วทั้งมหาวิทยาลัย"
    },
    "galleryImages": [
      "/images/projects/network-monitoring-1.jpg",
      "/images/projects/network-monitoring-2.jpg",
      "/images/projects/network-monitoring-3.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  },
  {
    "slug": "airlink-wifi-hotspot",
    "title": {
      "en": "Airlink Wi-Fi Hotspot (Open Source)",
      "th": "Airlink Wi-Fi Hotspot (Open Source)"
    },
    "tagline": {
      "en": "Captive Portal/Wi-Fi Hotspot system for internet access control",
      "th": "ระบบ Captive Portal/Wi-Fi Hotspot สำหรับควบคุมการใช้งานอินเทอร์เน็ต"
    },
    "year": "2016",
    "role": {
      "en": "Project Developer (Vocational College)",
      "th": "Project Developer (Vocational College)"
    },
    "stack": [
      "OpenWrt",
      "hostapd",
      "FreeRADIUS",
      "Ubuntu Server",
      "CLI",
      "QoS",
      "VLAN",
      "Firewall Policy"
    ],
    "coverImage": "/images/projects/wifi-hotspot-cover.jpg",
    "highlights": [
      {
        "en": "Deployed in college dormitory",
        "th": "ใช้งานจริงที่หอพักในวิทยาลัย"
      },
      {
        "en": "Supported high concurrent users",
        "th": "รองรับผู้ใช้ concurrent จำนวนมาก"
      },
      {
        "en": "Cost saving compared to commercial solutions",
        "th": "ช่วยลดค่าใช้จ่ายเมื่อเทียบโซลูชันเชิงพาณิชย์"
      }
    ],
    "problem": {
      "en": "The college needed a Wi-Fi control system for the dormitory, but commercial solutions were expensive and inflexible.",
      "th": "วิทยาลัยต้องการระบบควบคุมการใช้งาน Wi-Fi สำหรับนักศึกษาในหอพัก แต่โซลูชันเชิงพาณิชย์มีราคาสูง และไม่สามารถปรับแต่งได้ตามความต้องการขององค์กร"
    },
    "approach": {
      "en": "Designed and deployed a Captive Portal/Wi-Fi Hotspot on OpenWrt and hostapd with FreeRADIUS on Ubuntu Server. Optimized hardware/software (IRQ affinity, MTU, sysctl) for high concurrency. Configured QoS, VLAN, and Firewall Policy.",
      "th": "ออกแบบและติดตั้งระบบ Captive Portal/Wi-Fi Hotspot บน OpenWrt และ hostapd โดยใช้ FreeRADIUS บน Ubuntu Server (CLI) ใช้ Network Card แยกและปรับแต่งทั้ง Hardware และ Software (IRQ affinity, MTU, sysctl) เพื่อรองรับผู้ใช้ concurrent จำนวนมาก พร้อมตั้งค่า QoS, VLAN และ Firewall Policy เพื่อควบคุมการใช้งานอินเทอร์เน็ต"
    },
    "results": {
      "en": "Successfully deployed at Sisaket Rajabhat University dormitory, effectively controlling student internet usage. Significantly reduced costs compared to commercial solutions while maintaining customizability.",
      "th": "ระบบสามารถใช้งานจริงที่หอพักในวิทยาลัยราชภัฏศรีสะเกษ เพื่อควบคุมการใช้งานอินเทอร์เน็ตของนักศึกษาได้อย่างมีประสิทธิภาพ และช่วยลดค่าใช้จ่ายเมื่อเทียบกับโซลูชันเชิงพาณิชย์ได้อย่างมาก ในขณะที่ยังคงความสามารถในการปรับแต่งตามความต้องการ"
    },
    "galleryImages": [
      "/images/projects/wifi-hotspot-1.jpg",
      "/images/projects/wifi-hotspot-2.jpg"
    ],
    "links": {
      "caseStudy": "#"
    }
  }
]